## TITANIC DATA ANALYTICS USING PYTHON PANDAS AND MATPLOTLIB

TRANSEFERRING THE DATASET AND MAKING A COPY OF IT FOR THE PANEL

In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import panel as pn
from panel import bind
import hvplot.pandas

df=pd.read_csv('Book1.csv', encoding='latin-1')
pn.state.cache['data'] = df.copy()
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

<h5>Data Exploration</h5>

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
df.describe()

In [ ]:
df.columns

 </BR> DATA CLEANING: FILLING THE NaN VALUES WITH 0

In [ ]:
df=df.fillna(0)
idf=df.interactive()
df

</br> <h4>Problem 1 </h4>

In [ ]:
class info:
    female = df['Sex'].value_counts()['female']
    male = df['Sex'].value_counts()['male']
    survived_people = df['Survived'].sum()
    total_people=female + male
    died_people = total_people - survived_people

a1= print("ACCORDING TO DATASET: "),
    
print("\nTotal number of people: ", info.total_people),
    
print("\nNumber of injured people: ", info.survived_people),
    
print("\nNumber of deaths: ", info.died_people),
    
print("\naboarded number of females: ",info.female),
    
print("\naboarded number of males: ",info.male)

In [ ]:
class female:
    survived_female = df.groupby('Sex')['Survived'].value_counts()['female']    

a2= print("\nfemale passengers description: \n"),
print(female.survived_female)

In [ ]:
class male:
    survived_male = df.groupby('Sex')['Survived'].value_counts()['male']

a3=print("\nmale passengers description: \n"),
print(male.survived_male)

</br> Problem: GRAPH BASED ON TYPES OF PEOPLE

In [ ]:
data = pd.DataFrame({'People': ['Boarded', 'Injured', 'Deaths'],
                     'Number': [info.total_people, info.survived_people, info.died_people]})

# Plot the result using hvplot
people_plot = data.hvplot(kind='scatter', x='People', y='Number', marker='o', size=13, color='red') * \
            data.hvplot(kind='line', x='People', y='Number', color='green')

people_plot.opts(xlabel='Types of People', ylabel='Number', title='Number of People', 
                 fontsize={'xlabel': 18, 'ylabel': 16, 'title': 20})
people_plot

</br> Problem: GRAPH BASED ON SURVIVED NUMBER OF FEMALES AND MALES

In [ ]:
# Calculate the number of survived individuals by gender
by_gender = df.groupby('Sex')['Survived'].sum()

# Plot the result using hvplot
survived_plot = by_gender.hvplot(kind='bar', xlabel='Gender', ylabel='Number of Survived Individuals', title='Number of Survived Individuals by Gender', color='green')

survived_plot

</br> Problem 4: GRAPH BASED ON SURVIVED PEOPLE ACCORDING TO THEIR AGE GROUPS

In [ ]:
# Define age groups
df['AgeGroup'] = pd.cut(df['Age'], bins=[0, 18, 30, 50, 70, 100],
                        labels=['Child (0-18)', 'Teenager (18-30)', 'Young Adult (30-50)',
                                'Adult (50-70)', 'Elder Citizen (70-100)'])

# Calculate survival count by age group
by_age = df.groupby('AgeGroup',observed=False)['Survived'].sum()

# Plot the survival rate by age group
ageplot = by_age.hvplot.bar(rot=45, xlabel='Age Group', ylabel='Survival Count',title='Survival Count by Age Group')
ageplot

</br> Problem 5: GRAPH BASED ON SURVIVED PEOPLE ACCORDING TO PASSENGER CLASS

In [ ]:
# Calculate the survival rate by passenger class
survival_by_class = df.groupby('Pclass')['Survived'].mean()
survival_by_class = survival_by_class*100
# Plot the survival rate by passenger class
survival_by_class_plot = survival_by_class.hvplot(kind='bar', xlabel='Passenger Class', ylabel='Survival Rate',
                                                  title='Survival Rate by Passenger Class')
survival_by_class_plot

</BR> Problem 6: CREATING A PANEL USING TEMPLATE TO MAKE A DASHBOARD TO DISPLAY EVERY GRAPHS IN ONE PLACE

In [ ]:
template = pn.template.FastListTemplate(
    title='TITANIC DATA ANALYTICS USING PYTHON PANDAS AND MATPLOTLIB', 
    sidebar=[
        pn.pane.Markdown("# TITANIC DATA ANALYSIS"), 
        pn.pane.Markdown("#### RMS Titanic was a British passenger and mail carrying ocean liner, operated by the White Star Line, that sank in the North Atlantic Ocean on 15 April 1912 as a result of striking an iceberg.The disaster drew public attention, spurred major changes in maritime safety regulations, and inspired many artistic works."), 
        pn.pane.JPG('titanic.jpg', sizing_mode='scale_both')
            ],
    main=[
        pn.pane.Markdown(print(a1), width=550),
        pn.pane.Markdown(print(a2), width=550),
        pn.pane.Markdown(print(a3), width=550),
        pn.Row(pn.Column(people_plot.opts(width=700),margin=(0, 25))),
        pn.Row(pn.Column(survived_plot.opts(width=700), margin=(0, 25))),
        pn.Row(pn.Column(ageplot.opts(width=600), margin=(0, 25))),
        pn.Row(pn.Column(survival_by_class_plot))
    ])

# Serve the template
template.servable();